In [51]:
import pandas as pd
import matplotlib as plt

In [52]:
titanic= pd.read_csv('E:/Data Science Course/Datasets/titanic_data.csv')

In [53]:
titanic.head(5)

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
2,3,26.0,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0

In [54]:
titanic.drop(['Passengerid', 'zero','zero.1', 'zero.2','zero.3','zero.4','zero.5','zero.6','zero.7','zero.8','zero.9','zero.10','zero.11', 'zero.12','zero.13','zero.14','zero.15', 'zero.16', 'Embarked', 'zero.17', 'zero.18'], axis='columns', inplace=True)

In [55]:
titanic.head()

    Age     Fare  Sex  sibsp  Parch  Pclass  2urvived
0  22.0   7.2500    0      1      0       3         0
1  38.0  71.2833    1      1      0       1         1
2  26.0   7.9250    1      0      0       3         1
3  35.0  53.1000    1      1      0       1         1
4  35.0   8.0500    0      0      0       3         0

In [56]:
titanic.drop(['sibsp','Parch', ], axis='columns', inplace=True)

In [57]:
titanic.head()

    Age     Fare  Sex  Pclass  2urvived
0  22.0   7.2500    0       3         0
1  38.0  71.2833    1       1         1
2  26.0   7.9250    1       3         1
3  35.0  53.1000    1       1         1
4  35.0   8.0500    0       3         0

In [58]:
titanic=titanic.rename(columns={'2urvived':'Survived'})#renaming the column name from 2urvived to read 'Survived'

In [59]:
titanic.head()

    Age     Fare  Sex  Pclass  Survived
0  22.0   7.2500    0       3         0
1  38.0  71.2833    1       1         1
2  26.0   7.9250    1       3         1
3  35.0  53.1000    1       1         1
4  35.0   8.0500    0       3         0

In [60]:
target = titanic.Survived
inputs=titanic.drop('Survived', axis='columns')

In [61]:
target.head()# the dependent variable

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [62]:
inputs.head(5)# the new dataset called inputs will now have the independent variables having dropped the dependeent variable

    Age     Fare  Sex  Pclass
0  22.0   7.2500    0       3
1  38.0  71.2833    1       1
2  26.0   7.9250    1       3
3  35.0  53.1000    1       1
4  35.0   8.0500    0       3

In [63]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [64]:
inputs.dtypes# All are of appropriate datatype

Age       float64
Fare      float64
Sex         int64
Pclass      int64
dtype: object

In [66]:
inputs.Age[:15]

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5     28.0
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
Name: Age, dtype: float64

- Whenevr there are NA values, the best thing to dois always to take the mean values and fill in with it...with the mean value
- The code to use is as follows:
- inputs.Age = inputs.Age.fillna(inputs.Age.mean())
- inputs.head(15) - this will revel that all the previously na values have been filled with the mean values of the entire columns

In [68]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [69]:
len(x_train) # checkin gth elenght of training dataset

1047

In [70]:
len(x_test)

262

In [71]:
len(inputs)# total here was 1309. 1047 given to training and the remaining 262 give to testing the developed model

1309

In [77]:
#Naive bayes classification mode- GaussianNB is used when the data model is normal
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [78]:
model.fit(x_train, y_train)

GaussianNB()

In [80]:
model.score(x_test, y_test)

0.7786259541984732

- The above shows that the model predicted upto77.82%

In [85]:
x_test[:10]

       Age     Fare  Sex  Pclass
199   24.0  13.0000    1       2
489    9.0  15.9000    0       3
1177  28.0   7.2500    0       3
897   30.0   7.6292    1       3
1149  19.0  13.0000    1       2
257   30.0  86.5000    1       1
347   28.0  16.1000    1       3
914   21.0  61.3792    0       1
253   30.0  16.1000    0       3
415   28.0   8.0500    1       3

In [86]:
y_test[:10]

199     0
489     1
1177    0
897     0
1149    0
257     1
347     1
914     0
253     0
415     0
Name: Survived, dtype: int64

In [87]:
model.predict(x_test[:10])
# Tis may not predict 100% and is expected to make mistakes sometimes as our model is expected to predict around 78%

array([0, 0, 0, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [89]:
model.predict_proba(x_test[:10])# giving probabilities

array([[0.53406943, 0.46593057],
       [0.94032869, 0.05967131],
       [0.9565092 , 0.0434908 ],
       [0.69875493, 0.30124507],
       [0.51457977, 0.48542023],
       [0.20306472, 0.79693528],
       [0.6942635 , 0.3057365 ],
       [0.76549687, 0.23450313],
       [0.95741988, 0.04258012],
       [0.69431172, 0.30568828]])

In [1]:
import numpy as np

In [2]:
x  = 1/8.84858

In [3]:
x

0.11301248335891183

In [4]:
y = -0.25/25
y

-0.01

In [9]:
np.exp (-0.01)

0.9900498337491681

In [10]:
0.9900498337491681 * 0.11301248335891183

0.11188799036107128

In [11]:
0.112*0.5

0.056

In [12]:
np.exp (-3.61)

0.027051846866350416

In [13]:
0.027051846866350416*0.1128

0.0030514483265243267

In [14]:
0.0030514483265243267*0.5

0.0015257241632621633

In [15]:
21*21

441

In [16]:
441*4

1764

In [17]:
8/1764

0.0045351473922902496

In [18]:
1/18

0.05555555555555555

In [22]:
2/18

0.1111111111111111

In [20]:
2/4

0.5

In [23]:
0.05555555555555555*0.1111111111111111*0.5

0.0030864197530864196